Repository: overviewer/Minecraft-Overviewer
Catalog: docs/locales/*/LC_MESSAGES/index.po
Languages: es

source: The Minecraft Overviewer
es: El Overviewer de Minecraft

source: See also the `Github Homepage`_ and the `Updates Blog`_, and follow us on our `Twitter account`_.
es: Visita nuestra página de `Github <https://github.com/overviewer/Minecraft-Overviewer>`_, nuestro `Blog de Actualizaciones <https://overviewer.org/blog/>`_ y seguinos en nuestra `cuenta de Twitter <https://twitter.com/mcoverviewer>`_.

source: Introduction
es: Introducción

source: The Minecraft Overviewer is a command-line tool for rendering high-resolution maps of Minecraft Java Edition worlds. It generates a set of static html and image files and uses Leaflet to display a nice interactive map.
es: El Overviewer para Minecraft es una herramienta de comandos para renderizar mapas de alta resolución de Minecraft Edición Java. Este genera una serie de imágenes y archivos html, y usa Leaflet para mostrar un mapa interactivo.

source: The Overviewer has been in active development for several years and has many features, including day and night lighting, cave rendering, mineral overlays, and many plugins for even more features! It is written mostly in Python with critical sections in C as an extension module.
es: El Overviewer estuvo bajo desarrollo durante varios años y tiene varias funcionalidades, incluyendo iluminación de día y de noche, renderizado de cuevas, capas de minerales y ¡varias extensiones para más! Está escrito principalmente en Python, con algunas secciones críticas en C.

source: For a simple example of what your renders will look like, head over to `The "Exmaple" Map <https://overviewer.org/example/>`_. For more user-contributed examples, see `The Example Wiki Page <https://github.com/overviewer/Minecraft-Overviewer/wiki/Map-examples>`_.
es: Para un ejemplo simple de como se vería un renderizado, vaya a `Mapa de Ejemplo <https://overviewer.org/example/>`_. Para ver más ejemplos de usuarios, vea la `Página de Ejemplos <https://github.com/overviewer/Minecraft-Overviewer/wiki/Map-examples>`_.

source: Documentation Contents
es: Contenidos

source: Features
es: Características

source: Renders high resolution images of your world, lets you "deep zoom" and see details!
es: ¡Renderizados de muy alta calidad de tus mundos, que permiten realizar un "Acercamiento profundo" y ver detalles!

source: Gloriously awesome smooth lighting is here! (:ref:`rendermode<option_rendermode>` name is ``smooth_lighting``)
es: ¡La absolutamente increíble iluminación suave está aquí! (El nombre del :ref:`modo de renderizado<option_rendermode>` es ``smooth_lighting``)

source: Customizable textures! Pulls textures straight from your installed texture pack!
es: ¡Texturas perzonalizables! ¡Pon texturas directamente de tus pack de texturas favoritos!

source: Choose from four rendering angles.
es: Elige de cuatro ángulos de renderizado.

source: Generates a Leaflet powered map!
es: ¡Genera un mapa impulsado por Leaflet!

source: Runs on Linux, Windows, and Mac platforms!
es: ¡Corre en plataformas Linux, Windows y Mac!

source: Renders efficiently in parallel, using as many simultaneous processes as you want!
es: Renderiza eficientemente en paralelo, ¡Usando tantos procesos simultáneos como quieras!

source: *Only* requires: Python, Numpy, and PIL (all of which are included in the Windows download!)
es: *Solo* requiere: Python, Numpy y PIL (¡Los cuales están incluidos en la descarga de Windows!

source: Utilizes caching to speed up subsequent renderings of your world. Only parts that need re-rendering are re-rendered.
es: Utiliza caches para acelerar las renderizaciones posteriores de su mundo. Solo se vuelven a renderizar las partes que son necesarias.

source: Throw the output directory up on a web server to share your Minecraft world with the internet!
es: Pon la carpeta de salida en un servidor web para compartir tus mundos con todo internet.

source: Run The Overviewer from a command line or on a cron schedule for constantly updated maps! Run it for your Minecraft server world to provide your users with a detailed map!
es: Corre El Overviewer desde el símbolo del sistema o en un cronograma para tener tus mapas siempre actualizados. Usalo para brindarle a tus usuarios un mapa de calidad con mucho detalle.

source: Supports Nether and The End dimensions!
es: ¡Soporta las dimensiones del Inframundo y el Fin!

source: Built-in support for Biomes!
es: ¡Soporte de biomas incluido!

source: What The Overviewer is not
es: Que no es El Overviewer

source: Full disclosure disclaimers of what The Overviewer is *not*.
es: Descargo de responsabilidad de lo que *no* es El Overviewer

source: It does not run fast. Because of the high level of detail, initial renders of a world can take some time. Expect minutes for medium worlds, hours for large to huge worlds. Subsequent renders are *much* faster due to the caching.
es: No corre rápido. Dado al alto nivel de detalle, renderizaciones iniciales de un mundo pueden llevar un tiempo. Cuenta con varios minutos para mundos medianos, y hasta horas para mundos largos y gigantes. Las renderizaciones posteriores son *mucho más* rápidas dado al almacenamiento en caché

source: Also note that speed is improving all the time. We continually make efficiency improvements to The Overviewer. Besides, for the level of detail provided, our users consider it worth the time!
es: También ten en cuenta que la velocidad está mejorando todo el tiempo. Estamos continuamente haciendo mejoras en la eficiencia del Overviewer. Por otro lado, dado al nivel de detalle provisto, nuestros usuarios consideran que vale la pena la demora.

source: The Overviewer is not targeted at end users. We mainly see Overviewer fitting in best with server operators, rendering their server's map for all users to view.
es: El Overviewer no esta dirigido principalmente a jugadores y usuarios finales. Nosotros vemos al programa encajando mejor con operadores de servidores, para que sus usuarios vean el mapa del servidor.

source: You are welcome to use The Overviewer for your single player worlds, and it will work just fine. However, since the only interface is currently command line based, you will need to know a bit about the command line in order to operate The Overviewer.
es: Eres bienvenido a usar El Overviewer para tus mundos de un jugador, y funcionará sin problemas. Sin embargo, como la interfaz es a traves de comandos, deberás saber un poco sobre esto para poder operar al programa.

source: The Overviewer does not support Bedrock/Win10/Portable Edition worlds.
es: El Overviewer no soporta mundos de versiones Bedrock/Win10/Portable.

source: The Overviewer is not a potato.
es: El Overviewer no es una papa.

source: Requirements
es: Requerimientos

source: This is a quick list of what's required to run The Overviewer. It runs on Windows, Mac, and Linux as long as you have these software packages installed:
es: Esta es una lista rápida de que se requiere para correr el programa. Este corre en Windows, Mac y Linux mientras tengas estos paquetes instalados:

source: Python 3.4 or above (we are no longer compatible with Python 2.x)
es: Python 3.4 o superior (ya no somos compatibles con Python 2.x)

source: PIL (Python Imaging Library) or Pillow
es: PIL (Libreria de Imágenes de Python) o Pillow

source: Either a Minecraft Client installed or a textures/ folder for the textures (possibly from a texturepack)
es: El cliente de Minecraft instalado o texturas/ carpeta para texturas (Posiblemente de un pack de texturas)

source: The first three are included in the Windows download. Also, there are additional requirements for compiling it (like a compiler). More details are available in either the :doc:`Building <building>` or :doc:`Installing <installing>` pages.
es: Los primeros tres están incluidos en la descarga de Windows. Además, hay requirimientos adicionales para compilar (como un compilador). Más detalles están disponibles en las páginas sobre :doc:`Compilar <building>` o en :doc:`Instalar <installing>`.

source: Getting Started
es: Guía de Inicio

source: The Overviewer works with Linux, Mac, and Windows! We provide Windows and Debian built executables for your convenience. Find them as well as the full sources on our `Github Homepage`_.
es: ¡El Overviewer funciona en Linux, Mac o Windows! Nosotros proveemos de los executables para Windows y Debian por tu comodidad. Encuentra los executables como tambien la fuente completa en nuestra página de `Github <https://github.com/overviewer/Minecraft-Overviewer>`_.

source: **If you are running Windows, Debian, or Ubuntu and would like the pre-built packages and don't want to have to compile anything yourself**, head to the :doc:`installing` page.
es: **Si estás corriendo Windows, Debian o Ubuntu y te gustaría los paquetes pre-armados y no quieres compilar nada por ti mismo**, ve a :doc:`Instalar <installing>`.

source: **Running Windows and not familiar with the command line?** Head to the :doc:`win_tut/windowsguide` page.
es: **Corres Windows y no estás familiarizado con el Símbolo del sistema?** Ve a :doc:`Guía de Windows <win_tut/windowsguide>`.

source: **If you would like to build the Overviewer from source yourself (it's not that bad)**, head to the :doc:`Building <building>` page.
es: **Si te gustaría compilar El Overviewer desde la fuente tú mismo (no está tan mal)**, ve a :doc:`Compilar <building>`.

source: **For all other platforms** you will need to build it yourself. :doc:`building`.
es: **Para otras plataformas** deberás compilarlo tú mismo. :doc:`Compilar el Overviewer desde la fuente <building>`.

source: **After you have The Overviewer built/installed** see :doc:`running` and :doc:`config`.
es: **Cuando tengas el Overviewer compilado/instalado** vea :doc:`Correr el Overviewer <running>` y :doc:`El archivo de Configuración<config>`.

source: Help
es: Ayuda

source: **IF YOU NEED HELP COMPILING OR RUNNING THE OVERVIEWER** feel free to chat with us live in IRC: #overviewer on Libera.Chat. There's usually someone on there that can help you out. Not familiar with IRC? `Use the web client <https://overviewer.org/irc>`_. (If there's no immediate response, wait around or try a different time of day; we have to sleep sometime)
es: **SI NECESITAS AYUDA COMPILANDO O CORRIENDO EL OVERVIEWER** siéntete libre de contractarnos en IRC: #overviewer en Libera.Chat. Usualmente hay alguien ahí que te pueda ayudar. No conoces IRC? `Uso del cliente web <https://overviewer.org/irc>`_. (Si no hay respuesta inmediata, espera un rato o prueba un horario diferente; a veces tenemos que dormir).

source: Also check our :doc:`Frequently Asked Questions <faq>` page.
es: También visita nuestra pagina de :doc:`Preguntas Frecuentes <faq>`.

source: If you think you've found a bug or other issue, file an issue on our `Issue Tracker <https://github.com/overviewer/Minecraft-Overviewer/issues>`_. Filing or commenting on an issue sends a notice to our IRC channel, so the response time is often very good!
es: Si pensas que descubriste algun error o problema, archiva el problema en nuestro `Seguidor de Errores <https://github.com/overviewer/Minecraft-Overviewer/issues>`_. Comentar un problema manda una notificación a nuestro canal IRC, así que nuestros tiempos de respuesta suelen ser muy buenos.

source: Indices and tables
es: Índices y tablas

source: :ref:`genindex`
es: :ref:`Índice <genindex>`

source: :ref:`modindex`
es: :ref:`Índice de Modulos <modindex>`

source: :ref:`search`
es: :ref:`Página de Búsqueda<search>`
